{"pageProps":{"post":{"title":"Çerezler (Cookies) Nedir","slug":"cookies","intro":"Merhabalar bu yazımda sizlere genellikle sitelere girdiğimizde bir uyarı sayesinde ismini duyduğumuz Türkçe olarak çerez, İngilizce olarak cookie dediğimiz veri saklama türünden bahsedeceğim.            ","text":"Merhabalar bu yazımda sizlere genellikle sitelere girdiğimizde bir uyarı sayesinde ismini duyduğumuz Türkçe olarak çerez, İngilizce olarak cookie dediğimiz veri saklama türünden bahsedeceğim.\r\n\r\nAşağıdaki konu başlıklarına tıklayarak o konuyu anlattığım kısıma geçebilirsiniz.\r\n\r\n[Çerezlerin Tarihi](#m1)\r\n\r\n[Çerezler Nedir](#m2)\r\n\r\n[Çerezlerin Türleri](#m3)\r\n\r\n<div id=\"m1\"></div>\r\n\r\n## Çerezlerin Tarihi\r\n\r\nÇerezler, tarihte ilk olarak 1994 yılında Lou Montulli tarafından üretilmiştir. Lou nun çalıştığı Netscape adlı şirket farklı bir şirket için e-ticaret sitesi geliştiriyordu. Bu sitede kullanıcıların sepetine eklediği ürünler siteninin sunucusunda tutuluyordu. Bu da depolama açısında büyük bir sorun yaratıyordu. Bu yüzden Lou dan bu verileri sunucu yerine kullanıcının bilgisayarında tutulmasını sağlayacak bir çözüm istediler.\r\n\r\n<img src=\"./lou_mont.jpg\" alt=\"lou-image\"  width=\"500\" height=\"550\"/>\r\n\r\n\r\n<br/>\r\nBunun üzerine Lou Montulli ve John Giannandrea aynı yıl Netscape şirketinin kendi tarayıcısı olan Netscape Navigator tarayıcısının desteklediği bir çerez sistemi geliştirdiler. İlk kullanılan çerezin amacı kullanıcın siteye daha önce girip girmediğini kontrol ediyordu. Netscape Navigator dan sonra Internet Explorer da çerezleri kullanamya başlayınca çerezlerin kullanımı artmaya başladı.\r\n\r\n<div id=\"m2\"></div>\r\n<br/>\r\n\r\n## Çerezler Nedir\r\n\r\nÇerezlerle genel olarak <b>\"Bu internet sitesinde sizlere daha iyi hizmet sunulabilmesi için Çerezler kullanılmaktadır.\"</b> veya <b>\"Bu siteye giriş yaparak çerez kullanımını kabul etmiş sayılıyorsunuz\"</b> gibi uyarıları görerek tanışmışsınızdır. Peki bu uyarıların yapılmasının sebebi nedir?\r\n\r\n<img src=\"./cookie.png\" alt=\"cookie-image\"  width=\"650\"/>\r\n\r\n<br/>\r\nÇerezler tarayıcımızda sakladığımız ve girdiğimiz siteye özel olarak tutulan bir veri paketi türüdür. Beni hatırla butonu, sitede dil seçeneği ayarlama, e-ticaret sitelerindeki alışveriş sepetimiz gibi birçok alanda bizim tarayıcımızda tutulan çerezler sayesinde sitedeki deneyimimiz iyileştirilir. Bu kullanım alanları haricinde çerezler en çok reklamlar için kullanılır. Örneğin e-ticaret sitelerinde hangi ürüne bakmışız, hangi ürünü almışsak bu bilgiler işlenerek ileride buna göre reklamlarımız şekilleniyor. Bunun yanında sosyal medya uygulamalarında da beğendiğimiz fotoğraflar veya arama motorlarında yaptığımız aramalar çerezlerde tutularak bizim ilgi alanımıza göre reklamlar çıkartılıyor.\r\n\r\n<br/>\r\n<img src=\"./cookie_notice.jpg\" alt=\"cookie-notice-image\"  width=\"650\"/> \r\n\r\n<br/>\r\nÇerezler bu kadar kapsamlı bilgileri siteye girdiğimiz andan itibaren tutmaya başlıyor. Bu tarz bilgilerin kişinin izni olmadan tutulması yasal olmadığı için, çerez kullanan siteler siteye ilk girişimizde başta yazdığımız uyarılar gibi kullanıcının izninin olduğunu belirtmesini isteyen bir uyarıyı zorunlu olarak yazıyor. \r\n\r\n<div id=\"m3\"></div>\r\n<br/>\r\n\r\n## Çerezlerin Türleri\r\n\r\nÇerezlerin yapısında temel olarak çerezin geldiği site, çerezin ismi, çerezin içindeki değer ve çerezin ne zamana kadar geçerli olduğunu tutan bir değer vardır. Çerezler genel olarak birinci ve üçüncü taraf çerez olmak üzere ikiye ayrılır. Birinci taraf çerezler yukarıda bahsettiğimiz sitedeki deneyimimizi iyileştirecek bize kolaylık sağlayan işlemler için kullanılır. Birinci taraf çerezlerin domain kısmı olduğumuz site ile aynı olmak zorundadır.\r\n\r\n<img src=\"./cookie_struct.png\" alt=\"cookie-struct-image\"  width=\"650\"/> \r\n\r\n<br/>\r\nÜçüncü taraf çerezler ise çerezin domain kısmının olduğumuz siteden farklı olması sonucu oluşur. Bu çerezler reklamcılar veya analiz şirketleri tarafından kullanılır. Örnek olarak kullanıcının hangi sitelere girdiğini, hangi ürünlere baktığını ve hangi ürünleri aldığını tutarak ileride buna göre reklam önerileri oluşturur.\r\n\r\nBu tür çerezlerin bizden habersiz bir şekilde bizi takip etmesine engel olarak çerezlere özel kurallar getirildi. General Data Privacy Regulation ve California Consumer Privacy Act gibi yasalar ortaya çıktı. Bu yasaların sonucunda siteler için bazı gereklilikler ortaya çıktı.\r\n\r\n* Kullanıcılara sitenizin çerezleri kullandığını bildirmek.\r\n* Kullanıcıların çerezlerin bir kısmının veya tamamının alınmasını engelleme hakkı vermek.\r\n* Kullanıcının sitenizin büyük bir kısmını çerez almadan kullanılmasına izin vermek.\r\n\r\n---\r\n\r\nÇok basit bir yapısı olsa bile günümüzde Google ve Facebook gibi şirketlerin büyük bir kazancı bu çerezlerin kullanması sonucu yapılan reklamlar sayesinde oluyor. Eğer siz de tarayıcınızdaki çerezleri görmek isterseniz yapmanız gerekenler Control+Shift+J yapıp yukarıdaki panelde Application kısmını seçip soldaki panelden Cookies adlı seçeneği bulmak. Buradan o anki olduğunuz sayfada kullanılan bütün çerezleri görebilirsiniz.\r\n\r\nKaynakça:\r\n\r\n* <https://en.wikipedia.org/wiki/HTTP_cookie>\r\n* <https://developer.mozilla.org/en-US/docs/Web/HTTP/Cookies>","date":"25 Şubat 2021"}},"__N_SSG":true}