{"pageProps":{"post":{"title":"Piller Nasıl Çalışır","slug":"pil-calisma","intro":"Merhabalar bu yazımda hayatımızdaki birçok cihazda kullanılan pillerin çalışma mantığını anlatacağım. Bunun yanında pillerin tarihininden, pillerin türlerinden ve günümüzde en çok kullanılan pil türlerinden bahsedeceğim.","text":"Merhabalar bu yazımda hayatımızdaki birçok cihazda kullanılan pillerin çalışma mantığını anlatacağım. Bunun yanında pillerin tarihininden, pillerin türlerinden ve günümüzde en çok kullanılan pil türlerinden bahsedeceğim.\r\n\r\nAşağıdaki konu başlıklarına tıklayarak o konuyu anlattığım kısıma geçebilirsiniz.\r\n\r\n[Pillerin Tarihi](#m1)\r\n\r\n[Pillerin Çalışma Mantığı](#m2)\r\n\r\n[Pil Türleri](#m3)\r\n\r\n\r\n<div id=\"m1\"></div>\r\n\r\n## Pillerin Tarihi\r\n1791 yılında Luigi Galvani adlı bilim insanı hayvansal elektrik adlı teoriyi ortaya attı. Teoriye göre canlıları oluşturan hücreler elektrik içeriyordu. Galvani bu teoriyi ölü bir kurbağının bacaklarına asistanının kazayla statik elektrik birikmiş bir çubuğun iki ucuyla dokunması ve bunun sonucunda ölü kurbağanın bacağı kasılması sonucunda çıkarmıştır. \r\n\r\n<img src=\"./voltapili2.jpg\" alt=\"voltapil-image\"  width=\"650\"/>\r\n\r\n*(Volta pili)*\r\n\r\nBu teorinin üzerine çalışmalar yapan Alessandro Volta araştırmalarının sonucunda kurbağa bacağının elektrolit olarak davrandığını anlamıştır. Bunun üzerine aynı deneyi kurbağa yerine tuzlu suya batırılmış sünger ile yaptı ve elektrik akımı elde etmeyi başardı. Bunun üzerine bakır ve çinko kullanarak aralarına tuzlu sulu suya batırılmış kumaş veya sünger koyarak ilk pil olan Volta pilini icat etmiştir. Volta nın bu büyük icadından dolayı elektrik potansiyel farkı birimine ona ithafen Volt adı verilmiştir. \r\n\r\n<div id=\"m2\"></div>\r\n\r\n## Pillerin Çalışma Mantığı\r\nPil kimyasal enerjinin elektrik enerjisine dönüştürülmesini sağlayan bir aygıttır. Anot (- uç) ve Katot (+ uç) olmak üzere iki adet terminali vardır. Elektronlar anotta toplanır ve iki uç arasına bir iletken bağlandığında elektronlar anottan katota doğru gider. Pilin içindeki temel parçalar anot için bir madde, katot için bir madde ve bu iki maddenin arasına yerleştirilen tepkimenin sağlanması için elektrolit bir madde pilin temel parçalarıdır.\r\n\r\n<img src=\"./pilyapi.png\" alt=\"pilyapi-image\" height=\"400\" width=\"650\"/>\r\n\r\n*(Pilin iç yapısı)*\r\n\r\nBu üç temel maddenin değişimi sonucunda farklı türlerde piller ortaya çıkar. Kullanılan maddelere göre de pilin yapısı değişebilir. Kullanılan maddeler sonucunda birbirinden farklı reaksiyonlar oluşur ve her reaksiyon farklı büyüklükte gerilim üretebilir. Bu reaksiyonlar sonucunda elektronlar açığa çıkar bu elektronlar anottan katota doğru yol alır. Bu sayede pillerimiz çalışır.\r\n\r\n<div id=\"m3\"></div>\r\n\r\n## Pil Türleri\r\n\r\nPilleri temel olarak şarj edilebilir ve şarj edilemez piller olarak ikiye ayırıyoruz. Pilin şarj edilmesi demek pilin çalışırken yaptığı tepkimenin tersten yapılması demektir. Yani pil şarj olurken elektronlar katottan anota doğru gidiyor. Peki pillerin çalışma mantığı aynı ise neden bazılar şarj edilebiliyorken bazıları şarj edilemiyor. Bunun sebebi ise şarj edilemeyen pillerde oluşan reaksiyon ters olarak yapılamadığından veya yapılsa bile riskli olmasından dolayı bu piller şarj edilemiyor. \r\n\r\n<img src=\"./pilorn.gif\" alt=\"pilorn-image\" height=\"400\" width=\"650\"/>\r\n\r\n*(Pil çalışırken ve şarj olurken)*\r\n\r\nŞarj edilemeyen piller için örnek olarak en çok kullanılan çinko - karbon piler ve çinko karbon pillerden daha iyi olan Alkalin piller kullanılır. Genel olarak fazla enerji istemeyen küçük eşyalarda oyuncaklarda kullanılır.Bu piller genellikle şarj edilebilen pillere göre daha ucuz olduğundan kullanım oranı hala yüksektir. \r\n\r\nŞarj edilebilen piller için en çok kullanılan türler en aktif olan lityum metalini içerir. Bu piller lityum iyon ve lityum polimer pillerdir. Lityum iyon piller genel olarak belirli bir yapı olan 18650 tipinde üretilir. Genel olarak bilgisayar bataryalarında, elektrikli arabalarda, şarj edilebilen birçok cihazda kullanılır. Lityum polimer piller ise lityum iyona çok benzer sadece lityum iyona göre çok daha esnek bir yapıdadır. Bataryaları yüzünden çok kalın olan telefonlar ve bilgisayarlar lityum polimer piller sayesinde daha ince ve hafif oldu.\r\n\r\n---\r\n\r\nPil kullanımı ise son zamanlarda gittikçe artıyor. Özellikle elektrikli araba sektöründe arabanın en önemli noktası pilleri olduğu için pil konusunda büyük çalışmalar devam ediyor. Bu çalışmalar genel olarak lityum iyon pilin kapasitesini arttırmak ve maliyetini düşürmek amacıyla yapılıyor. Yakın bir gelecekte çoğu aracın elektrikli olacağını düşünürsek pil sektörünün kısa bir süre içinde olduğundan çok daha fazla büyüyeceğini düşünüyorum. \r\n\r\nKaynakça:\r\n\r\n- <https://en.wikipedia.org/wiki/Electric_battery>\r\n- <http://large.stanford.edu/courses/2010/ph240/nie1/>","date":"28 Ocak 2021"}},"__N_SSG":true}