{"pageProps":{"post":{"title":"QR Kodu Nasıl Çalışır","slug":"QRcode-calisma","intro":"Merhaba bu yazımda sizlere gunluk hayatta reklam panolarında, broşürlerde ve aklımıza gelebilecek her yerde gördüğümüz QR kodlarının ne olduğunu ve nasıl bir yapıda hazırlandığını anlatacağım.","text":"Merhaba bu yazımda sizlere gunluk hayatta reklam panolarında, broşürlerde ve aklımıza gelebilecek her yerde gördüğümüz QR kodlarının ne olduğunu ve nasıl bir yapıda hazırlandığını anlatacağım.\r\n\r\nAşağıdaki konu başlıklarına tıklayarak o konuyu anlattığım kısıma geçebilirsiniz.\r\n\r\n[QR Kodu Nedir?](#m1)\r\n\r\n[QR Kodun Yapısı Nasıldır?](#m2)\r\n\r\n[QR Kodu Nasıl Kodlanır?](#m3)\r\n\r\n<div id=\"m1\"></div>\r\n\r\n## QR Kodu Nedir?\r\n\r\nAdını Türkçede Çabuk Tepki anlamına gelen Quick Response kelimelerinden alan QR kodları 2 boyutlu barkodlardır. Barkodlar sadece bir açıda okutulabilirken QR kodlarını istediğimiz açıda okutabiliriz. İlk kez 1994 de Japon bir otomobil firması tarafından dizayn edilmiştir. QR kodları bir veriyi verinin büyüklüğüne ve verinin türüne bağlı olarak görselleştirir. QR kodları çözümlendiği zaman kullanıcıyı internet adresine, e-posta adresine, telefon numarasına vb birçok bilgiye yönlendirebilir. \r\n\r\n<img src=\"./color-qrcode.png\" alt=\"colorqr-image\" width=\"650\"/>\r\n\r\n*(QR kod örnekleri)*\r\n\r\nQR kodları gerekli parçaları olduktan sonra her renkte ve tasarımda yapılabilir. Ama çok renkli ve farklı tasarımdaki qr kodları iyi bir şekilde yapılamazsa qr kodunun okunması zorlaşabilir ya da veride bir kayıp olabilir. Bu yüzden en temel olan beyaz üzerine siyah ile yapılan qr kodları yaygın olarak kullanılır. QR kodunda bilgiler her hücrenin rengine göre 0 veya 1 olması sonucu tutulur.\r\n\r\n\r\n<div id=\"m2\"></div>\r\n\r\n## QR Kodun Yapısı Nasıldır?\r\n\r\nQR kodları 5 temel yapıdan oluşur.\r\n\r\n1- <b>Versiyon bilgisi</b> oluşturulacak qr kodun hangi qr kod versiyonunu kullanacağını belirler. Günümüzde 40 tane qr kod versiyonu vardır. Genel olarak 1 ile 7 arasındaki versiyonlar kullanılır.\r\n\r\n2- <b>Format bilgisi</b> qr koddaki hata düzeltme seviyesinin ne kadar büyük olacağını ve hangi mask patternın kullanılacağı bilgisini tutar.\r\n\r\n3- Kodlanmış verinin olduğu bölgedir. Bu bölge kullanılan hata düzenleme seviyesine ve mask patterna göre değişir. Yazımın ilerleyen kısımlarında buranın nasıl oluştuğunu daha detaylı anlatacağım.\r\n\r\n<img src=\"./qrcode.png\" alt=\"qrcode-image\" width=\"650\" height=\"300\"/>\r\n\r\n*(QR kodunun yapısı)*\r\n\r\n4- Gerekli desenleri üçe bölüyoruz\r\n\r\n1. <b>Pozisyon belirleme desenleri</b> qr kodun üç köşesine konulur. Temel olarak QR kodun varlığını göstermeye yararlar. QR kodu okuyacak cihazın kodu doğru bir şekilde tanımasına ve kodun yazdırıldığı yönün belirlenmesini bu sayede kodun hızlı bir şekilde okunmasını sağlar. \r\n\r\n2. <b>Hizalama desenleri</b> kodun kavisli yerlerde de daha rahat okunmasını sağlar. Her qr kodda yoktur kodun büyüklüğü arttıkça eklenmesi kodun okunmasına yardımcı olur. Birden fazla eklenebilir.\r\n\r\n3. <b>Zamanlama desenleri</b> sırasıyla siyah ve beyaz noktaların yerleştirilmesi sonucunda yapılır. Uzunluğu QR kodun ne kadar büyük olduğunu gösterir.\r\n\r\n5- <b>Sessiz Bölge</b> optimal okunabilirliğe ulaşmak için QR kodunun etrafında bırakılması gereken boş alandır. Kodun çevresine genellikle 4 hücrelik bir boşluk bırakılarak oluşturulur.\r\n\r\nDepolama alanı açısından qr kodları versiyonlarına göre değişirler. Versiyon ne kadar büyükse kodun alabileceği veri sayısı o kadar artar. 40. versiyonda maksimum 8 bit şeklinde 4296 karakter tutabilir.\r\n\r\nTemel olarak qr kodları bu parçalardan oluşur. Bir sonraki bölümde bu bölümde detaylı olarak anlatmadığım kodlanmış verinin olduğu kısmı anlatacağım.  \r\n\r\n<div id=\"m3\"></div>\r\n\r\n## QR Kodu Nasıl Kodlanır?\r\n\r\nQR kodlarında kodlanmasında kullanılan algoritma aynıdır. Ama kullanılan formata ve versiyona göre kod değişebilir. Alttaki resimde de görebileceğimiz gibi veri sağ alltan kodlanmaya başlar ve belirli bir düzende devam eder. Temel olarak 4 parçaya bölüyoruz.\r\n\r\n1- <b>Kodlama modu</b> buradaki seçilen desen qr kodun hangi tipte kodlandığını gösterir. Nümerik, alfanümerik ve byte tipinde kodlama bu tiplere örnektir.\r\n\r\n2- <b>Mesaj uzunluğu</b> koddaki verinin ne kadar uzun olduğunu gösterir.\r\n\r\n<img src=\"./encoding.png\" alt=\"encoding-image\" width=\"500\" />\r\n\r\n*(QR kodun kodlanma şekli)*\r\n\r\n3- <b>Veri kısmı</b> istenilen verinin bulunduğu kısımdır yukarıdaki resimde her harfin 8 bitlik bir alan kapladığını ve veri bitene kadar belirli bir düzende kodlandığını görüyoruz. Veri kısmının sonuna verinin bittiğini belli edecek bir desen koyulur.\r\n\r\n4- <b>Hata düzeltme</b> alanlarında Reed–Solomon hata düzeltmesi kullanılarak qr koda hasar gelse bile hasar çok büyük olmadığı sürece qr kodun okunabilmesini sağlar. Bu kısım format bilgisinin verildiği kısıma göre büyük ya da küçük olabilir. \r\n\r\nBu kısımdan sonrq qr kodun kodlanması bitmiş olur. Artık okunmaya hazırdır. QR kodun okunması içinse qr kodu okuyucular kullanılır. Bu okuyucular kodun yapısını bilerek çok kısa sürede bir okuma gerçekleştirerek koddaki bilgiyi kullanıcıya ulaştırır. \r\n\r\n---\r\n\r\nGünümüze kadar qr kodları genellikle bir siteye yönlendirilmek veya bir yazıyı tutmak için kullanılsa bile günümüzde kullanım alanları oldukça artmaya başladı. Bankacılık sektöründe ve marketlerdeki kasiyersiz kasalarda kullanımı yaygınlaşmaya başladı. Yakın bir gelecekte kullanımının çok daha fazla olacağına inanıyorum. \r\n\r\n<img src=\"./ahmetozmenqrcode.png\" alt=\"ahmetqr-image\"  />\r\n\r\nEğer siz de kendi qr kodlarınızı yapmak istiyorsanız bunun için [linkteki](https://www.the-qrcode-generator.com) siteye girip kendi qr kodlarınızı oluşturabilirsiniz.\r\n\r\nKaynakça:\r\n\r\n- <https://www.qr-code-generator.com/qr-code-marketing/qr-codes-basics/>\r\n- <https://en.wikipedia.org/wiki/QR_code>\r\n- <https://www.unitag.io/qrcode>\r\n","date":"14 Ocak 2021"}},"__N_SSG":true}